In [1]:
import pandas as pd

In [8]:
import numpy as np

In [9]:
my_series = pd.Series([4, 7, -5, 3, -1])

In [10]:
my_series

0    4
1    7
2   -5
3    3
4   -1
dtype: int64

In [11]:
my_series[4]

-1

In [12]:
my_series[my_series > 0]

0    4
1    7
3    3
dtype: int64

In [13]:
my_series * 10

0    40
1    70
2   -50
3    30
4   -10
dtype: int64

In [14]:
np.exp(my_series)

0      54.598150
1    1096.633158
2       0.006738
3      20.085537
4       0.367879
dtype: float64

In [15]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'],
    'age': [25, 8, 48],
    'job': ['Программист', 'Школьник', 'big Boss'],
    'salary': [100, 10, 200]
})

In [16]:
df

     name  age          job  salary
0    Маша   25  Программист     100
1    Вася    8     Школьник      10
2  Эдуард   48     big Boss     200

In [17]:
df['name']

0      Маша
1      Вася
2    Эдуард
Name: name, dtype: object

In [18]:
df[df['age'] > 18]

     name  age          job  salary
0    Маша   25  Программист     100
2  Эдуард   48     big Boss     200

In [19]:
df['salary'] *= 2

In [26]:
df.loc[1]

name          Вася
age              8
job       Школьник
salary          20
Name: 1, dtype: object

In [30]:
df.iloc[:1]

   name  age          job  salary
0  Маша   25  Программист     200

In [22]:
df.T

                  0         1         2
name           Маша      Вася    Эдуард
age              25         8        48
job     Программист  Школьник  big Boss
salary          200        20       400

In [23]:
df.T

                  0         1         2
name           Маша      Вася    Эдуард
age              25         8        48
job     Программист  Школьник  big Boss
salary          200        20       400